// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// // перетворіть значення на число за допомогою Number().

// let number = prompt('Введіть число:');
// number = Number(number);

// if (number === 10) {
//   alert('Вірно');
// } else {
//   alert('Невірно');
// }

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);
// const min = Math.floor(Math.random() * 60);

// let message;

// if (min >= 0 && min < 15) {
//   message = `${min} входить в першу чверть;`;
// } else if (min >= 15 && min < 30) {
//   message = `${min} входить в другу чверть;`;
// } else if (min >= 30 && min < 45) {
//   message = `${min} входить в третю чверть;`;
// } else if (min >= 45 && min < 60) {
//   message = `${min} входить в четверту чверть;`;
// }

// alert(message);
// 1.Створіть змінну з ім'ям name і присвойте їй ваше ім'я. Виведіть це ім'я в консоль.
// const name = 'Kate';
// console.log(name);

// // 2.Створіть змінну age і присвойте їй ваш вік. Виведіть в консоль рядок, що містить ваш вік у такому форматі: "Мені {вік} років".
// const age = 29;
// console.log(`Мені ${age} років`);
// // 3.Створіть змінні x і y і присвойте їм довільні числа. Виведіть в консоль результати додавання, віднімання, множення та ділення цих чисел.
// const x = 10;
// const y = 25;
// console.log(`${x + y}`);
// console.log(`${x - y}`);
// console.log(`${x * y}`);
// console.log(`${x / y}`);
// 4.Створіть змінну city і присвойте їй назву вашого міста. Створіть рядок, який містить "Я живу в місті {назва міста}", і виведіть його в консоль.

// const city = 'Kyiv';
// console.log(`Я живу в місті ${city}`);

// //5.Створіть рядок з вашою електронною поштою. Використайте методи рядка, щоб витягнути ваше ім'я та доменну частину. Виведіть обидва ці значення в консоль.
// const email = 'ivan.petrenko@gmail.com';
// const parts = email.split('@');

// const name = parts[0]; // Ім'я (до @)
// const domain = parts[1]; // Домен (після @)

// console.log(`Ім'я: ${name}`);
// console.log(`Домен: ${domain}`);

//   Створіть; змінну; price; і; присвойте; їй; число.Створіть; рядок, що; містить; ціну; з; символом; гривні, наприклад; "Ціна: 500 грн".
//     ;
// }

// const price = 600;
// console.log(`Ціна: ${price} грн`);
// // 7.Створіть змінну isLogged, яка має булеве значення. Виведіть в консоль повідомлення "Користувач авторизований", якщо isLogged дорівнює true, і "Користувач неавторизований", якщо isLogged дорівнює false.
// const isLogged = true;
// if (isLogged) {
//   console.log('Користувач авторизований');
// } else {
//   console.log('Користувач неавторизований');

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const num = prompt('Введіть число від 1 до 4');

// switch (num) {
//   case '1':
//     console.log('зима');
//     break;
//   case '2':
//     console.log('весна');
//     break;
//   case '3':
//     console.log('літо');
//     break;
//   case '4':
//     console.log('осінь');
//     break;
//   default:
//     console.log('Вибачте, але ви маєте ввести значення від 1 до 4 включно');
// }
const num = prompt('Введіть число від 1 до 7');
switch (num) {
  case '1':
    console.log('Понеділок');
    break;
  case '2':
    console.log('Вівторок');
    break;
  case '3':
    console.log('Середа');
    break;
  case '4':
    console.log('Четвер');
    break;
  case '5':
    console.log('Пʼятниця');
    break;
  case '6':
    console.log('Субота');
    break;
  case '7':
    console.log('Неділя');
    break;
  default:
    console.log('Вибачте, але ви маєте ввести число від 1 до 7 включно!');
}
